# a = []
# def func(my_list: list) ->None:
#     my_list.append(1)
# func(a)
# func(a)
# func(a)

# print(a)

# list () - список: изменяемый, индексируемый
# tuple() - кортеж: неизменяемый, индексируемый
# set () - множество: изменяемый, неиндексируемый
# dict () - словарь: изменяемый, индексируемый по ключу

# a=[4,242]
# my_tuple = tuple (a)
# my_tuple = 10,
# print(my_tuple)

# my_set = set()
# my_set={4,2,7}
# my_set.add(6)
# for i in my_set:
#     print(i)

# my_dict = dict()
# my_dict = {
#     ("20.12.1990","Василий"): "Стул",
#     753: "Стол"
# }

# my_dict[523]="Шкаф"
# for key in my_dict:
# print (key)


# Задайте список. Напишите программу, которая определит, присутствует ли в заданном списке строк некое число.

# list_str = ['12dhjhf', '123']

#------------------------------------------------------------------------------------------------
# 1. Задайте список. Напишите программу, которая определит, присутствует
#ли в заданном списке строк некое число.

#2. Напишите программу, которая определит позицию второго вхождения строки 
#в списке либо сообщит, что её нет.

#*Пример:*

#- список: ["qwe", "asd", "zxc", "qwe", "ertqwe"], ищем: "qwe", ответ: 3
#- список: ["йцу", "фыв", "ячс", "цук", "йцукен", "йцу"], ищем: "йцу", ответ: 5
#- список: ["йцу", "фыв", "ячс", "цук", "йцукен"], ищем: "йцу", ответ: -1
#- список: ["123", "234", 123, "567"], ищем: "123", ответ: -1
#- список: [], ищем: "123", ответ: -1

# org_text = ["qwe", "asgfd", "zxc", "3", "13ertqwe", "2", "3gf", "8"]
# find_text = input ("Введите искомую строку:")
# def text_finder(org_text: str, find_text: str):
#     counter = 0
#     for index in range (0, len (org_text)-len(find_text)+1):
#         if find_text in org_text[index:index+len (find_text)]: counter+=1
#     return counter


#---------------------------------------------------------------------------------
# str_list = ['12asd36', '256', 'dsds89358', '5698a']

# s_nym = input('Enter the number: ')
# is_Found = False

# for item in str_list:
#     print(item)
#     if item.__contains__(s_nym):
#         is_Found = True
#         break

# print(is_Found)

#----------------------------------------------------------------------------------

# list = ['123', '321', '456', '96']
# count = '3'
# array_find = []

# for find_count in list:
#     if count in find_count:
#         array_find.append(find_count)
# print(array_find)

#----------------------------------------------------------------------------------




